tap "gromgit/fuse"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Python dependency management tool
brew "pipenv"
# Interpreted, interactive, object-oriented programming language
brew "python"
# General-purpose scripting language
brew "php"
# Cross-platform application and UI framework
brew "qt@5"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Node version management
brew "n"
# Configurable static site generator
brew "hugo"
# GitHub command-line tool
brew "gh"
# Java build tool
brew "ant"
# Java-based project management
brew "maven"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Java-based scripting language
brew "groovy"
# Development kit for the Java programming language
brew "openjdk"
# Android SDK component
cask "android-platform-tools"
# Tools for building Android applications
cask "android-studio"
# Display and control your Android device
brew "scrcpy"
# Tools to work with Android .dex and Java .class files
brew "dex2jar"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Cross-platform make
brew "cmake"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Collection of portable C++ source libraries
brew "boost"
# Core application library for C
brew "glib"
# GNU debugger
brew "gdb"
# Curses-based interface to the GNU Debugger
brew "cgdb"
# File system integration
cask "macfuse"
# Read-write NTFS driver for FUSE
brew "gromgit/fuse/ntfs-3g-mac"
# Graphics library to dynamically manipulate images
brew "gd"
# GIF image/animation creator/editor
brew "gifsicle"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for encoding and decoding .avif files
brew "libavif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Vector graphics library with cross-device output support
brew "cairo"
# Manage compile and link flags for libraries
brew "pkg-config"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Internet file retriever
brew "wget"
# Lightweight and flexible command-line JSON processor
brew "jq"
# GNU awk utility
brew "gawk"
# Convert text between DOS, UNIX, and Mac formats
# Improved top (interactive process viewer)
brew "htop"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Open source suite of directory software
brew "openldap"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# OpenType text shaping engine
brew "harfbuzz"
# Atmel AVR MCU programmer
brew "avrdude"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Generic library support script
brew "libtool"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Multi-format archive and compression library
brew "libarchive"
# Parallel gzip
brew "pigz"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# ASCII-art displaying typo-corrector for commands
brew "gti"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Database of common MIME types
brew "shared-mime-info"
# Implementation of the file(1) command
brew "libmagic"
# Mac App Store command-line interface
brew "mas"
# Port scanning utility for large networks
brew "nmap"
# User interface to the TELNET protocol
brew "telnet"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Packet sniffer for displaying and logging HTTP traffic
brew "httpry"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Show the current WiFi network password
brew "wifi-password"
# Suite of barcodes-reading tools
brew "zbar"
# Implementation of 'offline nested' attack by Nethemba
brew "mfoc"
# Command-line fuzzy finder written in Go
brew "fzf"
# Penetration testing framework
cask "metasploit"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Firefox Web browser
cask "firefox"
# Google chrome Web browser
cask "google-chrome"
# Electronics prototyping platform
cask "arduino"
# Music player
cask "deezer"
# Voice and text chat software
cask "discord"
# Containers
cask "docker"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Electronics design automation suite
cask "kicad"
# IDE for Python programming - Community Edition
cask "pycharm-ce"
# IDE, client, and GUI for MongoDB
cask "studio-3t"
# Text editor for code, markup and prose
cask "sublime-text"
# Open-source BitTorrent client
cask "transmission"
# 3D printer and slicing GUI
cask "ultimaker-cura"
# Virtualizer for x86 hardware
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
# Application launcher and productivity software
cask "alfred"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application uninstaller
cask "appcleaner"
# Compare files and folders
cask "beyond-compare"
# Desktop client for Android Messages
cask "android-messages"
# Office suite
cask "microsoft-office"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Desktop customization tool
cask "geektool"
# Record analysis and transformation tool
cask "rq"
mas "Amphetamine", id: 937984704
mas "Codeshot", id: 1541665460
mas "Compare Folders", id: 816042486
mas "DeskApp for YouTube", id: 1180531112
mas "GarageBand", id: 682658836
mas "Image2icon", id: 992115977
mas "iMovie", id: 408981434
mas "JustJoin", id: 1514260034
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Twitter", id: 1482454543
mas "WhatsApp", id: 1147396723
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
